coq/src/auction.org

#+TITLE: Auction Smartcontract
#+AUTHOR: Lasse Letager Hansen

# Use org-tanglesync !
# lentic

#+HTML_HEAD: <style>pre.src {background-color: #303030; color: #e5e5e5;}</style>
#+PROPERTY: header-args:coq  :session *Coq*

# C-c C-v t   -  export this files
# C-c C-v b   -  create results / run this file
# C-c C-v s   -  create results / run subtree

* General information
:PROPERTIES:
:header-args: sh :eval never :results output silent
:END:
** Resulting output
#+begin_src sh
cargo clean
#+end_src

#+begin_src sh
cargo install --path language
#+end_src

#+begin_src sh
cargo build
#+end_src

#+begin_src sh
cargo hacspec -e v --dir coq/src -o Auction --org-file auction.org hacspec-auction
#+end_src

* Auction smart contract specification
** Config
#+begin_src toml :tangle ../../examples/auction/Cargo.toml :mkdirp yes :eval never
[package]
name = "hacspec-auction"
version = "0.1.0"
authors = [""]
edition = "2018"

[lib]
path = "src/auction.rs"

[dependencies]
hacspec-lib = { path = "../../lib" }
# pearlite-syn = { path = "../../../../creusot/pearlite-syn" }
creusot-contracts = { git = "https://github.com/xldenis/creusot", rev = "7763b3ae77205fba83182b9a6c3e69ad0b12fec7" }
# hacspec = {optional = true}
concordium-contracts-common = { path = "../../../../concordium-rust-smart-contracts/concordium-contracts-common" }
hacspec-concordium = { path = "../concordium" }
hacspec-concordium-derive = { path = "../concordium-derive" }

[features]
hacspec = []
# use_attributes = ["hacspec-attributes", "hacspec-attributes/print_attributes"]

[dev-dependencies]
hacspec-dev = { path = "../../utils/dev" }
criterion = "0.3"
rand = "0.8"
quickcheck = "1"
quickcheck_macros = "1"
#+end_src

** Rust code
:PROPERTIES:
:header-args: :tangle ../../examples/auction/src/auction.rs :mkdirp yes
:END:

*** Imports
#+begin_src rust :eval never
#[cfg(not(feature = "hacspec"))]
extern crate hacspec_lib;

use hacspec_lib::*;

// #[cfg(not(feature = "hacspec"))]
// extern crate creusot_contracts;
#[cfg(test)]
#[cfg(not(feature = "hacspec"))]
use creusot_contracts::{ensures, requires};

#+end_src

#+begin_src rust :eval never
// // Rust-hacspec Interface
#[cfg(not(feature = "hacspec"))]
use hacspec_concordium::{collections::BTreeMap, *};

#[cfg(feature = "hacspec")]
use concert_lib::*;

#+end_src

*** Types
#+begin_src rust :eval never
  array!(UserAddress, 32, u8); // U8

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_hacspec_to_rust_account_address(ua: UserAddress) -> AccountAddress {
      AccountAddress([
	  ua[0], ua[1], ua[2], ua[3], ua[4], ua[5], ua[6], ua[7], ua[8], ua[9], ua[10], ua[11],
	  ua[12], ua[13], ua[14], ua[15], ua[16], ua[17], ua[18], ua[19], ua[20], ua[21], ua[22],
	  ua[23], ua[24], ua[25], ua[26], ua[27], ua[28], ua[29], ua[30], ua[31],
      ])
  }

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_rust_to_hacspec_account_address(aa: &AccountAddress) -> UserAddress {
      UserAddress::from_native_slice(&aa.0)
  }
#+end_src

#+begin_src rust :eval never
  #[cfg(not(feature = "hacspec"))]
  /// The state in which an auction can be.
  #[derive(Debug, Eq, PartialEq, PartialOrd, Serialize, SchemaType)] // TODO: Debug with creusot 
  pub enum AuctionState {
      /// The auction is either
      /// - still accepting bids or
      /// - not accepting bids because it's past the auction end, but nobody has
      ///   finalized the auction yet.
      NotSoldYet,
      /// The auction is over and the item has been sold to the indicated address.
      Sold(AccountAddress), // winning account's address
  }

  /// The state in which an auction can be.
  #[derive(Clone, PartialEq)]
  pub enum AuctionStateHacspec {
      /// The auction is either
      /// - still accepting bids or
      /// - not accepting bids because it's past the auction end, but nobody has
      ///   finalized the auction yet.
      NotSoldYet,
      /// The auction is over and the item has been sold to the indicated address.
      Sold(UserAddress), // winning account's address
  }

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_hacspec_to_rust_auction_state(s : AuctionStateHacspec) -> AuctionState {
      match s {
	  AuctionStateHacspec::NotSoldYet => AuctionState::NotSoldYet,
	  AuctionStateHacspec::Sold(ua) => AuctionState::Sold(coerce_hacspec_to_rust_account_address(ua))
      }
  }

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_rust_to_hacspec_auction_state(s : &AuctionState) -> AuctionStateHacspec {
      match s {
	  AuctionState::NotSoldYet => AuctionStateHacspec::NotSoldYet,
	  AuctionState::Sold(aa) => AuctionStateHacspec::Sold(coerce_rust_to_hacspec_account_address(aa))
      }
  }

#+end_src

#+begin_src rust :eval never
  #[derive(Clone, PartialEq)]
  pub struct SeqMap(pub PublicByteSeq, pub PublicByteSeq);

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_hacspec_to_rust_b_tree_map(m: SeqMap) -> BTreeMap<AccountAddress, Amount> {
      let m1prime =
	  (0..m.0.len() / 32).map(|x| UserAddress::from_seq(&m.0.clone().slice(x * 32, 32)));
      let m2prime =
	  (0..m.1.len() / 8).map(|x| u64_from_be_bytes(u64Word::from_seq(&m.1.slice(x * 8, 8))));

      (m1prime.zip(m2prime)).fold(BTreeMap::new(), |mut t, (x, y)| {
	  t.insert(
	      coerce_hacspec_to_rust_account_address(x),
	      Amount { micro_ccd: y },
	  );
	  t
      })
  }

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_rust_to_hacspec_b_tree_map(m: &BTreeMap<AccountAddress, Amount>) -> SeqMap {
      SeqMap(
	  m.keys()
	      .map(|x| coerce_rust_to_hacspec_account_address(x))
	      .fold(PublicByteSeq::new(0_usize), |v, x| v.concat(&x)),
	  m.values()
	      .map(|x| x.micro_ccd)
	      .fold(PublicSeq::new(0_usize), |v, x| {
		  v.concat(&u64_to_be_bytes(x))
	      }),
      )
  }
#+end_src

#+begin_src rust :eval never

  #[cfg(not(feature = "hacspec"))]
  /// The state of the smart contract.
  /// This is the state that will be shown when the contract is queried using
  /// `concordium-client contract show`.
  #[contract_state(contract = "auction")]
  #[derive(Debug, Eq, PartialEq, Serialize, SchemaType)] // TODO: Debug, 
  pub struct State {
      /// Has the item been sold?
      auction_state: AuctionState,
      /// The highest bid so far (stored explicitly so that bidders can quickly
      /// see it)
      highest_bid:   Amount,
      /// The sold item (to be displayed to the auction participants), encoded in
      /// ASCII
      item:          Vec<u8>,
      /// Expiration time of the auction at which bids will be closed (to be
      /// displayed to the auction participants)
      expiry:        Timestamp,
      /// Keeping track of which account bid how much money
      // #[concordium(size_length = 2)] // TODO
      bids:          BTreeMap<AccountAddress, Amount>,
  }

  #[derive(Clone, PartialEq)]
  pub struct StateHacspec(
      pub AuctionStateHacspec,
      pub u64, // amount
      pub PublicByteSeq,
      pub u64, // timestamp
      pub SeqMap,
  );

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_hacspec_to_rust_state(s : StateHacspec) -> State {
      let StateHacspec(auction_state_hacspec, amount, item_seq, time, bid_map) = s;
      let auction_state = coerce_hacspec_to_rust_auction_state(auction_state_hacspec);
      let highest_bid = Amount { micro_ccd: amount };
      let item = item_seq.native_slice().to_vec();
      let expiry = Timestamp::from_timestamp_millis(time);
      let bids = coerce_hacspec_to_rust_b_tree_map(bid_map);

      State {
	  auction_state,
	  highest_bid,
	  item,
	  expiry,
	  bids,
      }
  }

  #[cfg(not(feature = "hacspec"))]
  pub fn coerce_rust_to_hacspec_state(s : &State) -> StateHacspec {
      let auction_state = coerce_rust_to_hacspec_auction_state(&s.auction_state);
      let highest_bid = s.highest_bid.micro_ccd;
      let item = PublicByteSeq::from_native_slice(&s.item);
      let expiry = s.expiry.timestamp_millis();
      let bids = coerce_rust_to_hacspec_b_tree_map(&s.bids);

      StateHacspec (
	  auction_state,
	  highest_bid,
	  item,
	  expiry,
	  bids,
      )
  }

#+end_src

*** Fresh state function
#+begin_src rust :eval never
pub fn fresh_state_hacspec(itm: PublicByteSeq, exp: u64) -> StateHacspec {
    StateHacspec(
	AuctionStateHacspec::NotSoldYet,
	0_u64,
	itm,
	exp,
	SeqMap(PublicByteSeq::new(0_usize), PublicByteSeq::new(0_usize)),
    )
}

#[cfg(not(feature = "hacspec"))]
/// A helper function to create a state for a new auction.
fn fresh_state(itm: Vec<u8>, exp: Timestamp) -> State {
    coerce_hacspec_to_rust_state(fresh_state_hacspec(
	PublicByteSeq::from_vec(itm),
	exp.timestamp_millis(),
    ))
}

#+end_src

#+begin_src rust :eval never
#[cfg(not(feature = "hacspec"))]
/// Type of the parameter to the `init` function.
#[derive(Serialize, SchemaType)]
struct InitParameter {
    /// The item to be sold, as a sequence of ASCII codes.
    item: Vec<u8>,
    /// Time of the auction end in the RFC 3339 format (https://tools.ietf.org/html/rfc3339)
    expiry: Timestamp,
}

#+end_src

#+begin_src rust :eval never
#[cfg(feature = "hacspec")]
struct InitParameter(
    /// The item to be sold, as a sequence of ASCII codes.
    PublicByteSeq,
    /// Time of the auction end in the RFC 3339 format (https://tools.ietf.org/html/rfc3339)
    u64,
);

#+end_src

#+begin_src rust :eval never
pub struct Context(UserAddress, UserAddress, u64, u64);
pub type ContextStateHacspec = (Context, StateHacspec);

#[cfg(feature = "hacspec")]
#[init(contract = "auction", parameter = "InitParameter")]
pub fn auction_init(ctx : Context, init_parameter: InitParameter) -> ContextStateHacspec {
    // Always succeeds
    (ctx, fresh_state_hacspec(PublicByteSeq::new(0), 0u64))
}

#+end_src

#+begin_src rust :eval never
#[cfg(not(feature = "hacspec"))]
/// Init function that creates a new auction
#[init(contract = "auction", parameter = "InitParameter")]
fn auction_init(ctx: &impl HasInitContext) -> InitResult<State> {
    let parameter: InitParameter = ctx.parameter_cursor().get()?;
    Ok(fresh_state(parameter.item, parameter.expiry))
}

#+end_src

*** Seq map entry
#+begin_src rust :eval never  
  fn seq_map_entry(m: SeqMap, sender_address: UserAddress) -> (u64, SeqMap) {
      let SeqMap(m0, m1) = m;

      let mut res = // MapEntry::Entry
	  (
	  0_u64,
	  SeqMap(
	      m0.clone().concat(&sender_address),
	      m1.clone().concat(&u64_to_be_bytes(0_u64)),
	  ),
      );
      
      // TODO: use chunks instead of doing the math yourself
      for x in 0..m0.clone().len() / 32 {
	  if UserAddress::from_seq(&m0.clone().slice(x * 32, 32)) == sender_address {
	      res = // MapEntry::Entry
		  (
		  u64_from_be_bytes(u64Word::from_seq(&m1.clone().slice(x * 8, 8))),
		  SeqMap(m0.clone(), m1.clone()),
	      );
	  }
      }

      res
  }
#+end_src
*** Map Update and result type
#+begin_src rust :eval never
  #[derive(Clone, PartialEq)]
  pub enum MapUpdate {
      Update(u64, SeqMap),
  }

  fn seq_map_update_entry(m: SeqMap, sender_address: UserAddress, amount: u64) -> MapUpdate {
      let SeqMap(m0, m1) = m;

      let mut res = MapUpdate::Update(
	  amount,
	  SeqMap(
	      m0.clone().concat(&sender_address),
	      m1.clone().concat(&u64_to_be_bytes(amount)),
	  ),
      );

      // TODO: use chunks instead of doing the math yourself
      // !! Issue in for loop !! (update, updates the reference!)
      for x in 0..m0.clone().len() / 32 {
	  if UserAddress::from_seq(&m0.clone().slice(x * 32, 32)) == sender_address {
	      res = MapUpdate::Update(
		  amount,
		  SeqMap(
		      m0.clone().update(x * 32, &sender_address),
		      m1.clone().update(x * 8, &u64_to_be_bytes(amount)),
		  ),
	      );
	  }
      }

      res
  }
#+end_src
