coq/_vc/_vc/Hacspec_Auction.v
(* [[file:auction.org::* auction - Coq code][auction - Coq code:1]] *)
